Apple: Rewrites for changes and localizations.
